### `question_706.md`

**Вопрос 706.** Вы являетесь организатором гонки. Длина трассы — 43872 метра. Вам известны средние скорости трех фаворитов гонки: Пети, Васи и Толи. Разработайте алгоритм на Python, который выведет имена победителей в порядке занятых мест.

*  Формат ввода:
    *   В первой строке записана средняя скорость Пети.
    *  Во второй строке  — средняя скорость Васи.
    * В третьей строке — средняя скорость Толи.
*   Формат вывода:
    *   Имена победителей в порядке занятых мест.

**Пример:**
```
Ввод:
10
5
7
Вывод:
1. Петя
2. Толя
3. Вася
```

- A. Для решения задачи необходимо только использовать оператор if, и сравнить скорости.
- B. Для решения задачи нужно использовать функцию sorted и отсортировать все скорости и вывести имена в нужном порядке.
- C. Для решения задачи нужно использовать цикл for,  где по очереди нужно проверять кто победил.
- D. Для решения задачи нужно  рассчитать время каждого участника, и сравнить их, и на основе результата вывести имена в нужном порядке.

**Правильный ответ: D**

**Объяснение:**

Для решения задачи определения победителей гонки, необходимо вычислить время, затраченное каждым участником на преодоление дистанции, и затем расположить их в порядке возрастания времени.

*   **Алгоритм (вычисление времени и сортировка):**
    1. **Сохранение данных:**  Создаем словарь, который связывает  имя участника со скоростью.
    2.  **Вычисление времени:** Для каждого участника,  время  вычисляется, как расстояние (43872) деленное на скорость.
        * Создается  список кортежей, где первый элемент - это вычисленное время, а второй имя участника.
    3.   **Сортировка:** Сортируем список кортежей  по возрастанию времени.
    4.  **Вывод результатов:**  Итерируемся по отсортированному списку кортежей,  и выводим  имена победителей с нумерацией.

*   **Преимущества алгоритма:**
    *   **Прямое вычисление:** Алгоритм  вычисляет  время, необходимое для достижения  финиша, что упрощает сравнение участников.
    *   **Сортировка:** Используется алгоритм  сортировки с временной сложностью `O(n log n)`.

**Примеры (псевдокод):**
```
function get_results_of_race(speed_p, speed_v, speed_t):
   distance = 43872
  players = {"Петя": speed_p, "Вася": speed_v, "Толя": speed_t}
   times = [ calculate time for each player , where time = distance/speed ]
   sort times from lowest to highest
   for index and player from  times:
      print index + 1, name
```
**Примеры реализации в Python:**
```python
def get_results_of_race(speed_p, speed_v, speed_t):
    distance = 43872
    players = {"Петя": speed_p, "Вася": speed_v, "Толя": speed_t}
    times = []
    for name, speed in players.items():
        time = distance / speed
        times.append((time, name))

    times.sort() #  сортируем по возрастанию времени
    for index, (time, name) in enumerate(times):
        print(f"{index + 1}. {name}")

speed_p1 = 10
speed_v1 = 5
speed_t1 = 7

print(f"Ввод:")
print(f"{speed_p1}")
print(f"{speed_v1}")
print(f"{speed_t1}")
print(f"Вывод:")
get_results_of_race(speed_p1, speed_v1, speed_t1) #  Выведет: 1. Петя\n2. Толя\n3. Вася

speed_p2 = 50
speed_v2 = 25
speed_t2 = 75
print(f"Ввод:")
print(f"{speed_p2}")
print(f"{speed_v2}")
print(f"{speed_t2}")
print(f"Вывод:")
get_results_of_race(speed_p2, speed_v2, speed_t2) # Выведет: 1. Толя\n2. Петя\n3. Вася
```

**Разбор вариантов:**
*  **A. Для решения задачи необходимо только использовать оператор `if`, и сравнить скорости.:** Неправильно.
*  **B. Для решения задачи нужно использовать функцию sorted и отсортировать все скорости и вывести имена в нужном порядке.:** Неправильно. Сначала необходимо вычисление времен.
*   **C. Для решения задачи нужно использовать цикл for, где по очереди нужно проверять кто победил.:** Неправильно.
*   **D. Для решения задачи нужно  рассчитать время каждого участника, и сравнить их, и на основе результата вывести имена в нужном порядке.:** Правильно.

**В результате:**
*   Алгоритм вычисляет  время  каждого участника,  используя  формулу `time = distance / speed`.
*   Сортировка  времени позволяет  определить  порядок прохождения трассы.
*   Алгоритм  возвращает  имена  в порядке занятых мест.

Таким образом, правильным ответом является **D. Для решения задачи нужно  рассчитать время каждого участника, и сравнить их, и на основе результата вывести имена в нужном порядке.**
